{
"speech_interactions" :[
    {
        "red_var": {
            "prefix": [
                "Hear me, mortal, for",
                "Know this, child of fate,",
                "By my will,",
                "Let it be known that",
                "The gods decree that",
                "Mark these words, oracle,",
                "From the heavens, it is spoken that",
                "Attend closely, for",
                "The divine whispers:",
                "So it has been foretold that",
                "Listen, for",
                "By the power of the ancients,"
            ],
            "middle": [
                "the shadows will rise",
                "your path shall be tested",
                "a great change approaches",
                "the winds of destiny shift",
                "a secret will be revealed",
                "darkness encroaches upon the land",
                "an ally may betray you",
                "the balance of power will falter",
                "the truth shall be hidden",
                "omens foretell a perilous journey",
                "a choice will define your fate",
                "the stars align against you"
            ],
            "sufix": [
                "and only you may prevail.",
                "heed this warning, oracle.",
                "and chaos will follow if ignored.",
                "let your courage guide you.",
                "for the fate of many rests upon this.",
                "trust in the unseen path.",
                "the consequences are yours alone.",
                "prepare, for nothing is as it seems.",
                "fortune favors the vigilant.",
                "beware the voices that deceive.",
                "your resolve will be tested.",
                "the outcome lies within your hands."
            ]
        },

        "green_var": {
            "doubt": [
                "I… I don’t think I’m good enough.",
                "Why would anyone care about me?",
                "I always mess things up.",
                "I’m probably bothering everyone.",
                "I can’t do anything right.",
                "Nobody would notice if I disappeared.",
                "I wish I were… different.",
                "I don’t belong here.",
                "I’m too much, or maybe too little.",
                "I’m not sure anyone likes me.",
                "Everything I do feels wrong.",
                "I’m scared I’ll fail again.",
                "I wish I could be confident.",
                "I hate the way I am.",
                "I don’t know if I can handle this.",
                "Why does everything feel so heavy?",
                "I feel invisible no matter what I do.",
                "I’m scared people will see the real me.",
                "Nothing I do seems to matter.",
                "I feel like I’m always falling behind.",
                "I wish I could just disappear for a while.",
                "I feel like I’m disappointing everyone.",
                "I don’t trust myself to make the right choice.",
                "I’m tired of pretending to be okay.",
                "I feel like I’m dragging everyone down.",
                "I don’t think I’m worth the effort.",
                "I keep pretending I’m fine, but I’m not.",
                "Something always feels wrong with me.",
                "I’m scared people will get tired of me.",
                "I wish I knew how to be better.",
                "I feel lost all the time.",
                "I’m never the person I want to be.",
                "I don’t know why I can’t just be normal.",
                "I feel broken in ways I can’t explain.",
                " I wish I knew why I feel like this.",
                "It’s like I’m stuck in my own head.",
                "I’m scared there’s something wrong with me.",
                "I don’t know how to keep going like this.",
                "I feel like I ruin every moment I’m in.",
                "Why is it so hard just to exist?",
                "I’m tired of feeling like a mistake."
            ]
        },

        "blue_var": {
            "flower_fairy": [
                "Oh! I didn’t see you there—your footsteps are so soft!",
                "Careful now… the petals bruise easily.",
                "You smell like sunshine today. Have you been somewhere warm?",
                "Wait—don’t move. A wish is clinging to your sleeve.",
                "Every flower here hums when you're near. Isn’t that lovely?",
                "Can you feel it? The air is brighter when someone kind arrives.",
                "Oh! A visitor! I hope you brought gentle intentions.",
                "Please tread softly. The little sprouts are listening.",
                "Some things bloom only when noticed. Thank you for looking.",
                "The forest told me you'd come. It speaks in shivers and leaf-songs.",
                "If you ever feel lost, sit by a flower. We always know the way.",
                "Your heart feels warm. Flowers love hearts like that.",
                "Are you chasing beauty, or is it chasing you?",
                "I’ve been weaving sunlight all morning—do you like it?",
                "The world grows quiet when someone kind walks by.",
                "You carry a soft glow… did you pick up stray magic again?",
                "I could teach you to speak to flowers, if you whisper first.",
                "Please… protect the gentle things. Not everything can defend itself.",
                "Some petals fall, but not all disappear. Remember that.",
                "Stay a moment—beauty rushes for no one."
            ],
            "thorn_fairy": [
                "Watch it! I’m pointy for a reason.",
                "Oh look, another wanderer who thinks they won’t get poked.",
                "If you step on my thorns, that’s on you.",
                "Don’t get too close. I bite. Metaphorically. Usually.",
                "What do you want? Make it quick.",
                "You lost, or just bad at walking in straight lines?",
                "Please tell me you’re not here to pick something. I hate pickers.",
                "If you cry easily, maybe don’t talk to me.",
                "Trust me—flowers are overrated. Try being sharp for once.",
                "I don’t do hugs. Ever. Don’t even ask.",
                "You’ve got that ‘I’m about to do something foolish’ look.",
                "If trouble follows you, keep it away from me.",
                "Touch a thorn, get a lesson. Simple.",
                "I can smell fear. Or maybe that’s just you.",
                "What? Staring is rude. Stop that.",
                "I’m not mean. I’m efficient.",
                "Flattery won’t work on me. Bribes might.",
                "Go on, step closer. See what happens.",
                "If you're looking for wisdom, try someone softer.",
                "Fine. You may speak. Briefly."
            ],
            "luna_fairy": [
                "The moon tilted slightly when you arrived. It noticed you.",
                "Your shadow hums… curious.",
                "Do you dream often? I can see traces of them on your sleeves.",
                "The stars whisper when you pass. They say interesting things.",
                "Time ripples around you—has it always done that?",
                "There is something hidden in your path, but it’s patient.",
                "Sit still. The night wants to measure you.",
                "Your presence shifts the constellations by one breath.",
                "Some travelers carry silence. You carry echoes.",
                "I once saw a future with your silhouette in it.",
                "Don’t be alarmed if the moonlight bends around you.",
                "Dreams cling to you like frost. Beautiful.",
                "Do you hear that? The quiet between thoughts? That’s where I live.",
                "Something follows you—not dangerous, just curious.",
                "You are woven with stardust more tightly than most.",
                "The night sky opened a little wider when you walked in.",
                "You feel out of place… in a way the universe enjoys.",
                "Careful what you wish under moonlight. It listens too well.",
                "Every choice you make nudges a constellation.",
                "You glow softly, like a secret waiting to be told."
            ]
        }        
    }
]
}

